Tekla Open API Reference for Tekla Structures 2025
PolygonNode.Contour Property
 Gets or sets the contour points of flat geometry.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Contour Contour { get; }
Public ReadOnly Property Contour As Contour
	Get
Property Value
Type: Contour
See Also
Reference
PolygonNode Class
Tekla.Structures.Model Namespace